package src.task00;
/*
Hello world
Создайте класс, который выводит на экран надпись "Hello world"
Класс создан, запускается из консоли, при этом выводит "Hello world" на экран
 */
public class Task00 {
    public static void main(String[] args) {
        System.out.println("Hello world");
    }
}
